In [8]:
import pandas as pd

In [9]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [10]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [11]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [12]:
df_one['k1'].nunique()

3

In [13]:
df_one['col2'].value_counts()

WA    2
NY    1
CA    1
AK    1
NV    1
Name: col2, dtype: int64

In [14]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [15]:
def grab_first_letter(state):
    return state[0]

In [16]:
grab_first_letter('NY')

'N'

In [17]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [18]:
df_one['initials'] = df_one['col2'].apply(grab_first_letter)

In [19]:
df_one

  k1  col1 col2 initials
0  A   100   NY        N
1  A   200   CA        C
2  B   300   WA        W
3  B   300   WA        W
4  C   400   AK        A
5  C   500   NV        N

In [20]:
my_map = {'A':1,'B':2,'C':3}

In [21]:
df_one['num'] = df_one['k1'].map(my_map)

In [22]:
df_one

  k1  col1 col2 initials  num
0  A   100   NY        N    1
1  A   200   CA        C    1
2  B   300   WA        W    2
3  B   300   WA        W    2
4  C   400   AK        A    3
5  C   500   NV        N    3

In [23]:
df_one['col1'].idxmax()

5

In [24]:
df_one['col1'].idxmin()

0

In [25]:
df_one.columns = ['c1','c2','c3','c4','c5']

In [26]:
df_one

  c1   c2  c3 c4  c5
0  A  100  NY  N   1
1  A  200  CA  C   1
2  B  300  WA  W   2
3  B  300  WA  W   2
4  C  400  AK  A   3
5  C  500  NV  N   3

In [28]:
df_one.sort_values('c3',ascending=False)

  c1   c2  c3 c4  c5
2  B  300  WA  W   2
3  B  300  WA  W   2
0  A  100  NY  N   1
5  C  500  NV  N   3
1  A  200  CA  C   1
4  C  400  AK  A   3

In [29]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})

predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [30]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [31]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [32]:
pd.concat([features,predictions],axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [34]:
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1